results/mpi_benchmark/sysbench_fio/fio_cephfs/oc_sys-fio_cephfs.worker00_1threads.4/stdout
sysbench 1.0.17 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     571.31
    fsyncs/s:                     732.95

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               8.93

General statistics:
    total time:                          10.1510s
    total number of events:              13113

Latency (ms):
         min:                                    0.00
         avg:                                    0.76
         max:                                   13.39
         95th percentile:                        2.71
         sum:                                 9994.97

Threads fairness:
    events (avg/stddev):           13113.0000/0.00
    execution time (avg/stddev):   9.9950/0.00

sysbench 1.0.17 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      1323.41
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  20.68
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0003s
    total number of events:              13236

Latency (ms):
         min:                                    0.00
         avg:                                    0.75
         max:                                   12.81
         95th percentile:                        1.27
         sum:                                 9991.38

Threads fairness:
    events (avg/stddev):           13236.0000/0.00
    execution time (avg/stddev):   9.9914/0.00

DONE